docs/steam.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>steam</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="orgd21c01a">
<div class="navbar-brand" id="org4b693a7">
<div class="navbar-item" id="org058996d">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org3b14a4b">
<div class="navbar-start" id="org0259688">
<div class="navbar-item" id="orgd74b7c2">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org4e490e8">

</div>

</div>
</nav>
<div id="outline-container-org9c5b95f" class="outline-2">
<h2 id="org9c5b95f">Steam</h2>
<div class="outline-text-2" id="text-org9c5b95f">
<ul class="org-ul">
<li><a href="https://gitlab.com/Mr_Goldberg/goldberg_emulator">steam emulator</a></li>
</ul>
</div>
<div id="outline-container-org0978086" class="outline-3">
<h3 id="org0978086">steam proton notes</h3>
<div class="outline-text-3" id="text-org0978086">
<ul class="org-ul">
<li>pressure vessel added in &gt; 5.10
<ul class="org-ul">
<li>conflicting glibc version for bash link so had to revert/build custom</li>
</ul></li>
<li><a href="https://github.com/ValveSoftware/steam-for-linux/issues/1890">does not respect XDG vars</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3058d7c" class="outline-2">
<h2 id="org3058d7c">Lutris</h2>
<div class="outline-text-2" id="text-org3058d7c">
<ul class="org-ul">
<li>installers battle.net</li>
</ul>
</div>
</div>
<div id="outline-container-org15c06a4" class="outline-2">
<h2 id="org15c06a4">Protonfixes for some games</h2>
<div class="outline-text-2" id="text-org15c06a4">
</div>
<div id="outline-container-org3379551" class="outline-3">
<h3 id="org3379551">Link localfixes</h3>
<div class="outline-text-3" id="text-org3379551">
<div class="org-src-container">
<pre class="src src-elisp" id="org76e178b">(ignore-errors (let* ((proton-dir (concat (file-name-as-directory (xdg-config-home)) "protonfixes"))
                      (localfixes-dir (concat (file-name-as-directory proton-dir) "localfixes")))
  (if (not (or (file-exists-p localfixes-dir) (file-symlink-p localfixes-dir)))
      (progn (make-directory localfixes-dir 1)
             (set-file-modes localfixes-dir #o700)))
  (if (not (or (file-exists-p (concat (file-name-as-directory localfixes-dir) "7110.py"))
               (file-symlink-p (concat (file-name-as-directory localfixes-dir) "7110.py"))))
      (make-symbolic-link (concat (file-name-directory (or load-file-name buffer-file-name)) "7110.py")
                          (concat (file-name-as-directory localfixes-dir) "7110.py") 1))
  (if (not (or (file-exists-p (concat (file-name-as-directory localfixes-dir) "22380.py"))
               (file-symlink-p (concat (file-name-as-directory localfixes-dir) "22380.py"))))
      (make-symbolic-link (concat (file-name-directory (or load-file-name buffer-file-name)) "22380.py")
                          (concat (file-name-as-directory localfixes-dir) "22380.py") 1))
  ))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6d85b5d" class="outline-3">
<h3 id="org6d85b5d">Jade Empire (process affinity)</h3>
<div class="outline-text-3" id="text-org6d85b5d">
<div class="org-src-container">
<pre class="src src-python" id="org1d050bb">""" Game fix Jade Empire: Special Edition
"""
#pylint: disable=C0103

import threading
import os
import subprocess
from protonfixes.logger import log

def _taskset():
    """Use taskset to set mask of JadeEmpire.exe"""
    # avoiding an external library as proc should be available on linux
    again = True
    badexes = ['JadeEmpire.exe']
    while again:
        pids = [pid for pid in os.listdir('/proc') if pid.isdigit()]
        for pid in pids:
            try:
                with open(os.path.join('/proc', pid, 'cmdline'), 'rb') as proc_cmd:
                    cmdline = proc_cmd.read()
                    for exe in badexes:
                        if exe in cmdline.decode():
                            mask = os.sched_getaffinity(pid)
                            while mask != {0} :
                                mask = os.sched_getaffinity(pid)
                            res = os.sched_setaffinity(pid, {0,1,2,3})
                            again = False
            except IOError:
                continue

@DeprecatedSince("5.0-3")
def main():
    """ Needs pid mask set on launch """
    thread = threading.Thread(target=_taskset, args=())
    thread.daemon = False
    thread.start()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc04b437" class="outline-3">
<h3 id="orgc04b437">Fallout New Vegas (audio/vk issues)</h3>
<div class="outline-text-3" id="text-orgc04b437">
<div class="org-src-container">
<pre class="src src-python" id="orgd7b6d84">""" Game fix for Fallout: New Vegas
"""
# pylint: disable=C0103
from protonfixes import util
from protonfixes.protonversion import DeprecatedSince

@DeprecatedSince("5.0-3")
def main():
    """ Use D3D9, quartz for audio, disable AA &amp; water reflections/refractions
    """
    # DX9 game
    util.disable_dxvk()

    # quartz for audio
    util.protontricks('quartz')

    # Graphics and HUD glitches when
    # AntiAliasing and Water Reflections/Refractions are enabled
    # https://github.com/ValveSoftware/Proton/issues/356
    user_opts = '''
    [Display]
    iMultiSample=0

    [Water]
    bUseWaterReflections=0
    bUseWaterRefractions=0
    '''
    util.set_ini_options(user_opts, 'My Games/FalloutNV/FalloutPrefs.ini')
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>